#include <LedControl.h>                      // LedControl 헥사파일을 선언

LedControl Dote = LedControl(6, 4, 5, 1);    // 모듈핀 위치 설정 ( DIN , CLK , CS , 몇번째 모듈)
// DIN - 6
// CLK - 4
// CS - 5

int sensor = 13            // 인체감지센서 연결 핀 13번
int value = 0;

byte digits[10][8] =                         // 0~9까지의 숫자를 byte 타입 2차원 배열로 구성
{                                            // 10개의 숫자(digits) , 8 byte의 신호
  {                                          // 숫자 0 
    B00111000,                               // 총 64개의 LED에 원하는 모양의 신호를 준다
    B01000100,
    B01000100,
    B01000100,
    B01000100,
    B01000100,
    B01000100,
    B00111000
  },
  {            // 숫자 1
    B00010000,
    B00110000,
    B00010000,
    B00010000,
    B00010000,
    B00010000,
    B00010000,
    B00111000 
  },
  {            // 숫자 2
    B00111000,
    B01000100,
    B00000100,
    B00000100,
    B00001000,
    B00010000,
    B00100000,
    B01111100
  },
  {            // 숫자 3
    B00111000,
    B01000100,
    B00000100,
    B00011000,
    B00000100,
    B00000100,
    B01000100,
    B00111000 
  },
  {            // 숫자 4
    B00000100,
    B00001100,
    B00010100,
    B00100100,
    B01000100,
    B01111100,
    B00000100,
    B00000100
  },
  {            // 숫자 5
    B01111100,
    B01000000,
    B01000000,
    B01111000,
    B00000100,
    B00000100,
    B01000100,
    B00111000
  },
  {            // 숫자 6
    B00111000,
    B01000100,
    B01000000,
    B01111000,
    B01000100,
    B01000100,
    B01000100,
    B00111000
  },
  {            // 숫자 7
    B01111100,
    B00000100,
    B00000100,
    B00001000,
    B00010000,
    B00100000,
    B00100000,
    B00100000
  },
  {            // 숫자 8
    B00111000,
    B01000100,
    B01000100,
    B00111000,
    B01000100,
    B01000100,
    B01000100,
    B00111000 
  },
  {            // 숫자 9
    B00111000,
    B01000100,
    B01000100,
    B01000100,
    B00111100,
    B00000100,
    B01000100,
    B00111000
  }
};

void setup() 
{
  Dote.shutdown(0, false);            // 절전모드로 (첫번째 모듈, 절전모드를 하지 않는다) 설정 
  Dote.setIntensity(0, 7);            // 밝기를 조절 (첫번째 모듈, 1~15까지 원하는 밝기) 설정
  Dote.clearDisplay(0);               // LED를 초기화 설정 (첫번째 모듈)

  pinMode (sensor, INPUT);
}

void loop() 
{
  value = digitalRead (sensor);       // 인체감지센서

  int i, j;                                      // for문에 사용할 변수 설정
  for (i = 0; i < 10; i++)                       // i는 0~9까지 10개의 숫자를 하나씩 표시 한다
  {
    for (j = 0; j <8; j++)                       // j는 미리 제작한 비트맵의 y축 8비트 신호를 하나씩 보낸다
    {
      Dote.setRow(0, j, digits[i][j]);           // setRow는 x축 LED를 한번에 제어하며,
    }                                            // (첫번째 모듈 , y축 신호, 2차원배열값 [숫자] [8비트신호])

  delay (500);                                   // 0.5초의 딜레이
  }
}
