#include <LedControl.h>

LedControl Dote = LedControl(7, 6, 5, 1);

int LED = 2;                        // LED 출력 2번
int sensor = 8;                     // 센서 입력 값 8번
int value = 0;                      // loop에서 사용할 value 변수 설정
int counter = 0;   // 카운터 변수

byte digirs[10][8] = {
   {                                                 // 숫자 0 
    B00111000,                             // 총 64개의 LED에 원하는 모양의 신호를 준다
    B01000100,
    B01000100,
    B01000100,
    B01000100,
    B01000100,
    B01000100,
    B00111000
  },

  {                                                  // 숫자 1
    B00010000,
    B00110000,
    B00010000,
    B00010000,
    B00010000,
    B00010000,
    B00010000,
    B00111000 
  },

  {                                                   // 숫자 2
    B00111000,
    B01000100,
    B00000100,
    B00000100,
    B00001000,
    B00010000,
    B00100000,
    B01111100
  },

  {                                                   // 숫자 3
    B00111000,
    B01000100,
    B00000100,
    B00011000,
    B00000100,
    B00000100,
    B01000100,
    B00111000 
  },

  {                                                    // 숫자 4
    B00000100,
    B00001100,
    B00010100,
    B00100100,
    B01000100,
    B01111100,
    B00000100,
    B00000100
  },

  {                                                     // 숫자 5
    B01111100,
    B01000000,
    B01000000,
    B01111000,
    B00000100,
    B00000100,
    B01000100,
    B00111000
  },

  {                                                      // 숫자 6
    B00111000,
    B01000100,
    B01000000,
    B01111000,
    B01000100,
    B01000100,
    B01000100,
    B00111000
  },

  {                                                       // 숫자 7
    B01111100,
    B00000100,
    B00000100,
    B00001000,
    B00010000,
    B00100000,
    B00100000,
    B00100000
  },

  {                                                        // 숫자 8
    B00111000,
    B01000100,
    B01000100,
    B00111000,
    B01000100,
    B01000100,
    B01000100,
    B00111000 
  },

  {                                                         // 숫자 9
    B00111000,
    B01000100,
    B01000100,
    B01000100,
    B00111100,
    B00000100,
    B01000100,
    B00111000
  }
};


void setup() 
{
    pinMode (LED, OUTPUT);          // 핀모드 LED 출력으로 설정
    pinMode (sensor, INPUT);        //  핀모드 센서 입력값으로 설정

    Dote.shutdown(0, false);
    Dote.setIntensity(0, 7);
    Dote.clearDisplay(0);
}

void loop() 
{
    value = digitalRead(sensor);    // 변수 value에 디지털 센서값 저장
    if(value == HIGH)               // 인체 감지 센서가 작동한 경우
    {
      counter++;       // 1씩 증가
      if (counter > 9) // 카운터가 9를 초과하면 0으로 초기화
      {
        counter = 0;
      }
    }
    if (value == HIGH)
    {
      digitalWrite(LED, HIGH);      // LED를 인체 감지 센서의 값에 따라 제어
    }
    else
    {
      digitalWrite(LED, LOW);
    }
}